nerd_food/on_evolutionary_methodology.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-03-28 Sun 16:03 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Nerd Food: On Evolutionary Methodology</title>
<meta name="generator" content="Org mode" />
<link rel="stylesheet" href="../css/tufte.css" type="text/css" />
</head>
<body>
<div id="content">
<h1 class="title">Nerd Food: On Evolutionary Methodology</h1>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left"><a href="index.html">Back to essay index</a></td>
<td class="org-left"><a href="../index.html">Back to home page</a></td>
</tr>
</tbody>
</table>

<p>
Wednesday, June 11, 2008
</p>

<div class="epigraph"><blockquote>
<p>
Unix's durability and adaptability have been nothing short of
astonishing. Other technologies have come and gone like
mayflies. Machines have increased a thousand-fold in power, languages
have mutated, industry practice has gone through multiple
revolutions - and Unix hangs in there, still producing, still paying
the bills, and still commanding loyalty from many of the best and
brightest software technologists on the planet. &#x2013; ESR
</p>

</blockquote></div>

<div class="epigraph"><blockquote>
<p>
Unix&#x2026;is not so much a product as it is a painstakingly compiled oral
history of the hacker subculture. &#x2013; Neal Stephenson
</p>

</blockquote></div>

<div id="outline-container-orga608bfa" class="outline-2">
<h2 id="orga608bfa">The Impossibly Scalable System</h2>
<div class="outline-text-2" id="text-orga608bfa">
<p>
If development in general is an art or a craft, its finest hour is
perhaps the maintenance of existing systems which have high
availability requirements but are still experiencing high rates of
change. As we covered previously, maintenance in general is a task
much neglected in the majority of commercial shops, and many products
suffer from entropic development; that is, the piling on of changes
which continuously raise the complexity bar, up to a point where it is
no longer cost-effective to continue running the existing system. The
word "legacy" is in itself filled with predestination, implying old
systems cannot avoid time-decay and will eventually rot into oblivion.
</p>

<p>
The story is rather different when one looks at a few successful Free
and Open Source Software (FOSS) systems out there. For starters,
"legacy" is not something one often hears on that side of the fence;
projects are either maintained or not maintained, and can freely flip
from one state to the other. Age is not only <span class="underline">not</span> a bad thing, but,
in many cases, it is a remarkable advantage. Many projects that
survived their first decade are now stronger than ever: the Linux
kernel, x.org, Samba, Postgresql, Apache, gcc, gdb, subversion, GTK,
and many, many others. Some, like Wine, took a decade to mature and
are now showing great promise.
</p>

<p>
Each of these old timers has its fair share of lessons to teach, all
of them incredibly valuable; but the project I'm particularly
interested in is the Linux kernel. I'll abbreviate it to Linux or "the
kernel" from now on.
</p>

<p>
As published recently in a study by Kroah-Hartman, Corbet and
McPherson, the kernel suffers a daily onslaught of unimaginable
proportions. Recent kernels are a joint effort of thousands of kernel
hackers in dozens of countries, a fair portion of which working or
well over 100 companies. On average, these developers added or
modified around 5K lines per day during the 2.6.24 release cycle and,
crucially, removed some 1.5K lines per day - and "day" here includes
weekends too. Kernel development is carried out in hundreds of
different kernel trees, and the merge paths between these trees obeys
no strictly enforced rules - it does follow convention, but rules get
bent when the situation requires it.
</p>

<p>
It is incredibly difficult to convey in words just how much of a
technical and social achievement the kernel is, but one is still
compelled to try. The absolute master of scalability, it ranges from
the tiniest embedded processor with no MMU to the largest of the large
systems - some spanning as many as 4096 processors - and covering
pretty much everything else in between: mobile phones, Set-Top Boxes
(STBs), game consoles, PCs, large severs, supercomputers. It supports
more hardware architectures than any other kernel ever engineered, a
number which seemingly keeps on growing at the same rate new hardware
is being invented. Linux is increasingly the kernel of choice for new
architectures, mainly because it is extremely easy to port. Even real
time - long considered the unassailable domain of special purpose - is
beginning to cave in, unable to resist the relentless march of the
penguin. And the same is happening in many other niches.
</p>

<p>
The most amazing thing about Linux may not even be its current state,
but its pace, as clearly demonstrated by Kroah-Hartman, Corbet and
McPherson's analysis of kernel source size: it has displayed a near
constant growth rate between 2.6.11 and 2.6.24, hovering at around 10%
a year. Figures on this scale can only be supported by a catalytic
development process. And in effect, that is what Linux provides: by
getting better it implicitly lowers the entry barrier to new adopters,
which find it closer and closer to their needs; thus more and more
people join in and fix what they perceive to be the limitations of the
kernel, making it even more accessible to the next batch of adopters.
</p>

<p>
Although some won't admit it now, the truth is none of the
practitioners or academicians believed that such a system could ever
be delivered. After all, Linux commits every single schoolboy error:
started by an "inexperienced" undergrad, it did not have much of an
upfront design, architecture and purpose; it originally had the firm
objective of supporting only a single processor on x86; it follows the
age-old monolithic approach rather than the "established"
micro-kernel; it is written in C instead of a modern, object-oriented
language; its processes appear to be haphazard, including a clear
disregard for Brook's law; it lacks a rigorous Q&amp;A process and until
very recently even a basic kernel debugger; version control was first
introduced over a decade after the project was started; there is no
clear commercial (or even centralised) ownership; there is no "vision"
and no centralised decision making (Linus may be the final arbiter,
but he relies on the opinions of a lot of people). The list continues
ad infinitum.
</p>

<p>
And yet, against all expert advice, against all odds, Linux is the
little kernel that could. If one were to write a spec covering the
capabilities of vanilla 2.6.25, it would run thousands of pages long;
its cost would be monstrous; and no company or government department
would dare to take on such an immense undertaking. Whichever way you
look at it, Linux is a software engineering singularity.
</p>

<p>
But how on earth can Linux work at all, and how did it make it thus
far?
</p>
</div>
</div>

<div id="outline-container-org1ae47c2" class="outline-2">
<h2 id="org1ae47c2">Linus' Way</h2>
<div class="outline-text-2" id="text-org1ae47c2">
<div class="epigraph"><blockquote>
<p>
I'm basically a very lazy person who likes to get credit for things
other people actually do. &#x2013; Linus Torvalds
</p>

</blockquote></div>

<p>
The engine of Linux's growth is deeply rooted in the kernel's
methodology of software development, but it manifests itself as a set
of core values - a culture. As with any other school of thought, not
all kernel hackers share all values, but the group as a whole displays
some obvious homogeneous characteristics. These we shall call Linus'
Way, and are loosely summarised below (apologies for some redundancy,
but some aspects are very interrelated).
</p>
</div>
