nerd_food/on_evolutionary_methodology.org
** Small is beautiful

- Design is only useful on the small scale; there is no need to worry
  about the big picture - if anything, worrying about the big picture
  is considered harmful. Focus on the little decisions and ensure they
  are done correctly. From these, a system will emerge that _appears_
  to have had a grand design and purpose.
- At a small scale, do not spend too long designing and do not be
  overambitious. Rapid prototyping is the key. Think simple and do not
  over design. If you spend too much time thinking about all the
  possible permutations and solutions, you will create messy and
  unmaintainable code which will very likely going to be wrong. Best
  implement a small subset of functionality that works well, is easy
  to understand and can be evolved over time to cover any additional
  requirements.

** Show me the Code

- Experimentation is much more important than theory by several orders
  of magnitude. You may know everything there is to know about coding
  practice and theory, but your opinion will only be heard if you have
  solid code in the wild to back it up.
- Specifications and class diagrams are frowned upon; you can do them
  for your own benefit, but they won't sell any ideas by themselves.
- Coding is a messy business and is full of compromises. Accept that
  and get on with it. Do not search for perfection before showing code
  to a wider audience. Better to have a crap system (sub-system,
  module, algorithm, etc.) that works somewhat today than a perfect
  one in a year or two. Crap systems can be made slightly less crappy;
  vapourware has no redeeming features.
- Merit is important, and merit is measured by code. Your ability to
  do boring tasks well can also earn a lot of brownie points (testing,
  documentation, bug hunting, etc.) and will have a large positive
  impact on your status. The more you are known and trusted in the
  community, the easier it will be for you to merge new code in and
  the more responsibilities you will end up having. Nothing is more
  important than merit as gauged by the previous indicators; it
  matters not what position you hold on your company, how important
  your company is or how many billions of dollars are at stake - nor
  does it matter how many academic titles you hold. However, past
  actions do not last forever: you must continue to talk sense to have
  the support of the community.
- Testing is crucial, but not just in the conventional sense. The key
  is to release things into a wider population ("Release early,
  release often"). The more exposure code has the more likely bugs
  will be found and fixed. As ESR put it, "Given enough eyeballs, all
  bugs are shallow" (dubbed Linus' law). Conventional testing is also
  welcome (the more the merrier), but its no substitute for releasing
  into the wild.
- Read the source, Luke. The latest code is the only authoritative and
  unambiguous source of understanding. This attitude does not in
  anyway devalue additional documentation; it just means that the
  kernel's source code overrides any such document. Thus there is a
  great impetus in making code readable, easy to understand and
  conformant to standards. It is also very much in line with Jack
  Reeve's view that source code is the only real specification a
  software system has.
- Make it work first, then make it better. When taking on existing
  code, one should always first make it work as intended by the
  original coders; then a set of cleanup patches can be written to
  make it better. Never start by rewriting existing code.

** No sacred cows

- _anything_ related to the kernel can change, including processes,
  code, tools, fundamental algorithms, interfaces, people. Nothing is
  done "just because". Everything can be improved, and no change is
  deemed too risky. It may have to be scheduled, and it may take a
  long time to be merged in; but if a change is of "good taste" and,
  when required, provided the originator displays the traits of a good
  maintainer, it will eventually be accepted. Nothing can stand on the
  way of progress.
- As a kernel hacker, you have no doubts that you are right - but
  actively you encourage others to prove you wrong and accept their
  findings once they have been a) implemented (a prototype would do,
  as long as it is complete enough for the purpose) b) peer reviewed
  and validated. In the majority of cases you gracefully accept
  defeat. This may imply a turn-around of 180 degrees; Linus has done
  this on many occasions.
- Processes are made to serve development. When a process is found
  wanting - regardless of how ingrained it is or how useful it has
  been in the past - it can and will be changed. This is often done
  very aggressively. Processes only exist while they provide visible
  benefits to developers or, in very few cases, due to external
  requirements (ownership attribution comes to mind). Processes are
  continuously fine-tuned so that they add the smallest possible
  amount of overhead to real work. A process that improves things
  dramatically but adds a large overhead is not accepted until the
  overhead is shaved off to the bare bone.

** Tools

- Must fit the development model - the development model should not
  have to change to fit tools;
- Must not dumb down developers (i.e. debuggers); a tool must be an
  aid and never a replacement for hard-thinking;
- Must be incredibly flexible; ease of use can never come at the
  expense of raw, unadultered power;
- Must not force everyone else to use that tool; some exceptions can
  be made, but on the whole a tool should not add
  dependencies. Developers should be free to develop with whatever
  tools they know best.

** The Lieutenants

One may come up with clever ways of doing things, and even provide
conclusive experimental evidence on how a change would improve
matters; however, if one's change will disrupt existing code and
requires specialised knowledge, then it is important to display the
characteristics of a good maintainer in order to get the changes
merged in. Some of these traits are:

- Good understanding of kernel's processes;
- Good social interaction: an ability to listen to other kernel
  hackers, and be ready to change your code;
- An ability to do boring tasks well, such as patch reviews and
  integration work;
- An understanding of how to implement disruptive changes, striving to
  contain disruption to the absolute minimum and a deep understanding
  of fault isolation.

** Patches

Patches have been used for eons. However, the kernel fine-tuned the
notion to the extreme, putting it at the very core of software
development. Thus all changes to be merged in are split into patches
and each patch has a fairly concise objective, against which a review
can be performed. This has forced all kernel hackers to _think_ in
terms of patches, making changes smaller and concise, and splitting
scaffolding and clean up work and decoupling features from each
other. The end result is a ridiculously large amount of positive
externalities - unanticipated side-effects - such as technologies that
get developed for one purpose but uses that were never dreamt of by
their creator. The benefits of this approach are far too great to
discuss here but hopefully we'll have a dedicated article on the
subject.

