nerd_food/on_evolutionary_methodology.org
** Other

- Keep politics out. The vast majority of decisions are taken on
  technical merits alone, and very rarely for political reasons. Some
  times the two coincide (such as the dislike for binary modules in
  the kernel), but one must not forget that the key driver is always
  the technical reasoning. For instance, the kernel uses the GNU GPL
  v2 purely because its the best way to ensure its openness, a key
  building block of the development process.
- Experience trumps fashion. Whenever choosing an approach or a
  technology, kernel hackers tend to go for the beaten track rather
  than new and exciting ones. This is not to say there is no
  innovation in the kernel; but innovators have the onus of proving
  that their approach is better. After all, there is a solid body of
  over 30 years of experience in developing UNIX kernels; its best to
  stand on the shoulders of giants whenever possible.
- An aggressive attitude towards bad code, or code that does not
  follow the standards. People attempting to add bad code are told so
  in no uncertain terms, in full public view. This discourages many a
  developer, but also ensures that the entry bar is raised to avoid
  lowering the signal-to-noise (S/N) ratio.

If there ever was a single word that could describe a kernel hacker,
that word would have to be "pragmatic". A kernel hacker sees
development as a hard activity that should remain hard. Any other view
of the world would result in lower quality code.

