nerd_food/on_evolutionary_methodology.html

<div id="outline-container-orgf8a22d8" class="outline-3">
<h3 id="orgf8a22d8">Navigating Complexity</h3>
<div class="outline-text-3" id="text-orgf8a22d8">
<p>
Linus has stated in many occasions he is a big believer of development
by evolution rather than the more traditional methodologies. In a way,
he is the father of the evolutionary approach when applied to software
design and maintenance. I'll just call this the evolutionary
methodology (EM) by want of a better name. EM's properties make it
strikingly different from everything that has preceded it. In
particular, it appears to remove most forms of centralised
control. For instance:
</p>

<ul class="org-ul">
<li>It does not allow you to know where you're heading in the long run;
all it can tell you is that if you're currently on a favourable
state, a small, gradual increment is <span class="underline">likely</span> to take you to
another, slightly more favourable state. When measured in a large
timescale it will appear as if you have designed the system as a
whole with a clear direction; in reality, this "clearness" is an
emergent property (a side-effect) of thousands or small decisions.</li>
<li>It exploits parallelism by trying lots of different gradual
increments in lots of members of its population and selecting the
ones which appear to be the most promising.</li>
<li>It favours promiscuity (or diversity): code coming from anywhere can
intermix with any other code.</li>
</ul>

<p>
But how exactly does EM work? And why does it seem to be better than
the traditional approaches? The search for these answers takes us
right back to the fundamentals. And by "fundamentals", I really mean
the absolute fundamentals - you'll have to grin and bear, I'm
afraid. I'll attempt to borrow some ideas from Popper, Taleb, and
Dawkins to make the argument less nonsensical.
</p>

<p>
That which we call reality can be imagined as a space with a really,
really large number of variables. Just how large one cannot know, as
the number of variables is unknowable - it could even be infinite -
and it is subject to change (new variables can be created; existing
ones can be destroyed, and so on). With regards to the variables
themselves, they change value every so often but this frequency
varies; some change so slowly they could be better describbed as
constants, others so rapidly they cannot be measured. And the
frequency itself can be subject to change.
</p>

<p>
When seen over time, these variables are curves, and reality is the
space where all these curves live. To make matters more interesting,
changes on one variable can cause changes to other variables, which in
turn can also change other variables and so on. The changes can take
many forms and display subtle correlations.
</p>

<p>
As you can see, reality is the stuff of pure, unadulterated complexity
and thus, by definition, any attempt to describe it in its entirety
cannot be accurate. However, this simple view suffices for the
purposes of our exercise.
</p>

<p>
Now imagine, if you will, a model. A model is effectively a) the
grabbing of a small subset of variables detected in reality; b) the
analysis of the behaviour of these variables over time; c) the issuing
of statements regarding their behaviour - statements which have not
been proven to be false during the analysis period; d) the validation
of the models predictions against past events (calibration). Where the
model is found wanting, it needs to be changed to accommodate the new
data. This may mean adding new variables, removing existing ones that
were not found useful, tweaking variables, and so on. Rinse,
repeat. These are very much the basics of the scientific method.
</p>

<p>
Models are rather fragile things, and its easy to demonstrate
empirically why. First and foremost, they will always be incomplete;
exactly how incomplete one cannot know. You never know when you are
going to end outside the model until you are there, so it must be
treated with distrust. Second, the longer it takes you to create a
model - a period during which validation is severely impaired - the
higher the likelihood of it being wrong when its "finished". For very
much the same reasons, the larger the changes you make in one go, the
higher the likelihood of breaking the model. Thirdly, the longer a
model has been producing correct results, the higher the probability
that the next result will be correct. But the exact probability cannot
be known. Finally, a model must endure constant change to remain
useful - it may have to change as frequently as the behaviour of the
variables it models.
</p>

<p>
In such an environment, one has no option but to leave certainty and
absolutes behind. It is just not possible to "prove" anything, because
there is a large component of randomness and unknown-ability that
cannot be removed. Reality is a messy affair. The only certainty one
can hold on to is that of fallibility: a statement is held to be
possibly true until proven false. Nothing else can be said. In
addition, empiricism is highly favoured here; that is, the ability to
look at the data, formulate an hypothesis without too much theoretical
background and put it to the test in the wild.
</p>

<p>
So how does this relate to code? Well, every software system ever
designed is a model. Source code is nothing but a set of statements
regarding variables and the rules and relationships that bind them. It
may model conceptual things or physical things - but they all inhabit
a reality similar to the one described above. Software systems have
become increasingly complex over time - in other words, taking on more
and more variables. An operative system such as multics, deemed
phenomenally complex for its time, would be considered normal by
today's standards - even taking into account the difficult environment
at the time with non-standard hardware, lack of experience on that
problem domain, and so on.
</p>

<p>
In effect, it is this increase in complexity that breaks down older
software development methodologies. For example, the waterfall method
is not "wrong" per se; it can work extremely well in a problem domain
that covers a small number of variables which are not expected to
change very often. You can still use it today to create perfectly
valid systems, just as long as these caveats apply. The same can be
said for the iterative model, with its focus on rapid cycles of
design, implementation and testing. It certainly copes with much
larger (and faster moving) problem domains than the waterfall model,
but it too breaks down as we start cranking up the complexity
dial. There is a point where your development cycles cannot be made
any smaller, testers cannot augment their coverage, etc. EM, however,
is at its best in absurdly complex problem domains - places where no
other methodology could aim to go.
</p>

<p>
In short, EM's greatest advantages in taming complexity are as
follows:
</p>

<ul class="org-ul">
<li>Move from one known good point to another known good point. Patches
are the key here, since they provide us with small units of
reviewable code that can be checked by any experienced developer
with a bit of time. By forcing all changes to be split into
manageable patches, developers are forced to think in terms of
small, incremental changes. This is precisely the sort of behaviour
one would want in a complex environment.</li>
<li>Validate, validate and then validate some more. In other words,
Release Early, Release Often. Whilst Linus has allowed testing and
Q&amp;A infrastructure to be put in place by interested parties, the
main emphasis has always been placed in putting code out there in
the wild as quickly as possible. The incredibly diverse environments
on which the kernel runs provide a very harsh and unforgiving
validation that brings out a great number of bugs that could not
have possibly been found otherwise.</li>
<li>No one knows what the right thing is, so try as many possible
avenues as possible simultaneously. Diversity is the key, not only
in terms of hardware (number of architectures, endless permutations
within the same architecture, etc.), but also in terms of
agendas. Everyone involved in Linux development has their own agenda
and is working towards their own goal. These individual
requirements, many times conflicting, go through the kernel
development process and end up being converted into a number of
fundamental architectural changes (in the design sense, not the
hardware sense) that effectively are the superset of all
requirements, and provide the building blocks needed to implement
them. The process of integrating a large change to the kernel can
take a very long time, and be broken into a sequence of never ending
patches; but many a time it has been found that one patch that adds
infrastructure for a given feature also provides a much better way
of doing things in parts of the kernel that are entirely unrelated.</li>
</ul>

<p>
Not only does EM manage complexity really well but it actually thrives
on it. The pulling of the code base in multiple directions makes it
stronger because it forces it to be really plastic and
maintainable. It should also be quite clear by now that EM can only be
deployed successfully under somewhat limited (but well defined)
circumstances, and it requires a very strong commitment to
openness. It is important to build a community to generate the
diversity that propels development, otherwise its nothing but the
iterative method in disguise done out in the open. And building a
community entails relinquishing the traditional notions of ownership;
people have to feel empowered if one is to maximise their
contributions. Furthermore, it is almost impossible to direct this
engine to attain specific goals - conventional software companies
would struggle to understand this way of thinking.
</p>

<p>
Just to be clear, I would like to stress the point: it is not right to
say that the methodologies that put emphasis on design and centralised
control are wrong, just like a hammer is not a bad tool. Moreover, its
futile to promote one programming paradigm over another, such as
Object-Orientation over Procedural programming; One may be superior to
the other on the small, but on the large - the real world - they
cannot by themselves make any significant difference (class libraries,
however, are an entirely different beast).
</p>

<p>
I'm not sure if there was ever any doubt; but to me, the kernel proves
conclusively that the human factor dwarfs any other in the production
of large scale software.
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left"><a href="index.html">Back to essay index</a></td>
<td class="org-left"><a href="../index.html">Back to home page</a></td>
</tr>
</tbody>
</table>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Created: 2021-03-28 Sun 16:03</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
